[
    {
        "service": "amazon_polly",
        "videoId": "jXPN12ReUJg",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "Amazon Polly"
        ],
        "title": "Text-to-Speech with Amazon Polly",
        "description": "Learn more about Amazon Polly at - http://amzn.to/2wAUWqL.\nAmazon Polly is a service that turns text into lifelike speech, allowing you to create applications that talk, and build entirely new categories of speech-enabled products. Amazon Polly is an Amazon AI service that uses advanced deep learning technologies to synthesize speech that sounds like a human voice. With dozens of lifelike voices across a variety of languages, you can select the ideal voice and build speech-enabled applications that work in many different countries.",
        "date": "2017-08-07T16:35:42Z",
        "duration": 129
    },
    {
        "service": "amazon_polly",
        "videoId": "PLnRzHNmcao",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "AWS Innovate Online Conference 2018"
        ],
        "title": "Building Intelligent Chatbots with Amazon Lex & Amazon Polly",
        "description": "Learn more at - https://amzn.to/2v4ZAkG\nAWS offers a family of AI services that provide cloud-native Machine Learning and Deep Learning technologies allowing developers to build an entirely new generation of apps that can hear, speak, understand, and converse with application users. In this session we take a look at Amazon Polly and Amazon Lex and how we can use these services to build intelligent chatbots across social media, websites and kiosks.\n\nSpeaker: \n- Adam Larter, Developer Solutions Architect, Amazon Web Services, ANZ",
        "date": "2018-04-12T18:59:53Z",
        "duration": 1667
    },
    {
        "service": "amazon_polly",
        "videoId": "b1dyAOh3NeE",
        "tags": [
            "AWS re:Invent 2017",
            "Amazon",
            "Mois",
            "Machine Learning",
            "MCL307",
            "AI",
            "Lex",
            "Polly",
            "ML"
        ],
        "title": "AWS re:Invent 2017: Amazon Polly Tips and Tricks: How to Bring Your Text-to-Speech V (MCL307)",
        "description": "Although there are many ways to optimize the speech generated by Amazon Polly's text-to-speech voices, you might find it challenging to apply the most effective enhancements in each situation. Learn how you can control pronunciation, intonation, and timing for text-to-speech voices. In this session, you get a comprehensive overview of the available tools and methods available for modifying Amazon Polly speech output, including SSML tags, lexicons, and punctuation. You also get recommendations for streamlining application of these techniques. Come away with insider tips on the best speech optimization techniques to provide a more natural voice experience.",
        "date": "2017-12-01T16:45:27Z",
        "duration": 3499
    },
    {
        "service": "amazon_polly",
        "videoId": "MKxE8_qQTFQ",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "Amazon Polly",
            "Andy Jassy keynote"
        ],
        "title": "AWS re:Invent 2016: Introducing Amazon Polly",
        "description": "Learn more about Amazon Polly here: http://amzn.to/2heMV31\nAmazon Polly is a service that turns text into lifelike speech. Polly lets you create applications that talk, enabling you to build entirely new categories of speech-enabled products. Polly is an Amazon AI service that uses advanced deep learning technologies to synthesize speech that sounds like a human voice. Polly includes 47 lifelike voices spread across 24 languages, so you can select the ideal voice and build speech-enabled applications that work in many different countries. Amazon Polly delivers the consistently fast response times required to support real-time, interactive dialog. You can cache and save Polly’s speech audio to replay offline or redistribute. And Polly is easy to use. You simply send the text you want converted into speech to the Polly API, and Polly immediately returns the audio stream to your application so your application can play it directly or store it in a standard audio file format, such as MP3.",
        "date": "2016-12-06T22:35:56Z",
        "duration": 81
    },
    {
        "service": "amazon_polly",
        "videoId": "9cXjTQ3Af5M",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "Amazon Polly",
            "amazon alexa",
            "convert text to speech",
            "AWS Educate"
        ],
        "title": "AWS Educate - Bring Your Site to Life with Amazon Polly",
        "description": "Learn more about AWS Educate at - https://amzn.to/2Aq8DNS.\nIn the final show of our series, we take you through how to integrate the Amazon Polly Wordpress plugin which will enable you to easily voice your content so readers can listen to news and articles directly from your site.\n\nThe plugin also enables you to publish podcasts directly from your site and make them available for listeners who are on-the-go.\n\nAmazon Polly is a service that allows you to convert text to lifelike speech, using the same technology that powers Amazon Alexa.",
        "date": "2018-10-24T16:51:46Z",
        "duration": 2142
    },
    {
        "service": "amazon_polly",
        "videoId": "5HYR0_FXSYc",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "Twitch",
            "re:invent",
            "machine learning"
        ],
        "title": "Live Coding with AWS | Reading Web Pages with Amazon Polly & Chrome Extensions",
        "description": "Check out the upcoming schedule, previous recordings, and links to the resources discussed at - http://amzn.to/2BtQIqq.\n\nBuild a browser extension that reads a web page using Amazon Polly in this interactive twitch.tv/aws live coding session with Randall Hunt, Sr. Technical Evangelist. \n\nAmazon Polly is a service that turns text into lifelike speech, allowing you to create applications that talk, and build entirely new categories of speech-enabled products. Amazon Polly is a text-to-speech service that uses advanced deep learning technologies to synthesize speech that sounds like a human voice. With dozens of lifelike voices across a variety of languages, you can select the ideal voice and build speech-enabled applications that work in many different countries.\n\nFor more information on Amazon SageMaker, visit https://aws.amazon.com/sagemaker/.",
        "date": "2018-02-14T20:16:44Z",
        "duration": 7983
    },
    {
        "service": "amazon_polly",
        "videoId": "OhLrxGw-zJA",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "FICO",
            "Amazon Polly",
            "text-to-speech",
            "deep learning"
        ],
        "title": "Scaling FICO Customer Communication Services with Amazon Polly Text-to-Speech",
        "description": "Learn more about Amazon Polly at - https://amzn.to/2ESniAd.\nFICO Customer Communication Services (CSS) team focuses on providing automated voice, text and email communications to help organizations with fraud detection and customer service. Learn how they use Amazon Polly Text-to-Speech to power a range of voice applications to improve the customer experience.",
        "date": "2018-04-17T20:44:25Z",
        "duration": 176
    },
    {
        "service": "amazon_polly",
        "videoId": "RkTgi6O58xo",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "Amazon Polly",
            "AWS Machine Learning Use cases",
            "Machine learning case study NLP services",
            "text to speech API",
            "chatbot on Amazon polly",
            "Artificial Inteligence"
        ],
        "title": "How Policybazaar Uses Amazon Polly to Personalize the Customer Experience",
        "description": "Learn more about AWS Startups at - https://amzn.to/2EibytO.\nPolicybazaar.com is India’s leading insurance web aggregator with millions of customers nationwide who can quickly compare and purchase plans. Find out how Amazon Polly helped Policybazaar increase the voice message adoption by customer by 20%, improve customer experience and save on customer servicing costs.",
        "date": "2019-02-19T16:44:48Z",
        "duration": 168
    },
    {
        "service": "amazon_polly",
        "videoId": "UO0hGTvqLUs",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "Translatem",
            "Polly",
            "Rekognition",
            ".NET",
            "Framework",
            "Core"
        ],
        "title": "Using Amazon Translate,  Amazon Polly, and Amazon Rekognition with .NET",
        "description": "Learn more about AWS at – https://amzn.to/2AG2wnS\nIn this video, we show you how to use Amazon Translate, Amazon Polly and Amazon Rekognition in your .NET application.",
        "date": "2019-10-04T18:11:40Z",
        "duration": 393
    },
    {
        "service": "amazon_polly",
        "videoId": "lYGl5qE6q7s",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "AWS San Francisco Summit 2017"
        ],
        "title": "AWS Summit Series 2017 - San Francisco: Amazon Polly Introduces a Whispered Voice Tag",
        "description": "You can now add a whispered speech effect in your Text-to-Speech output with Amazon Polly, and support visual animations that are synchronized with speech output using Speech Marks. Try both new features through the Amazon Polly console.\n\nLearn more at - https://aws.amazon.com/blogs/aws/new-amazon-polly-speech-marks/",
        "date": "2017-04-20T16:01:20Z",
        "duration": 80
    },
    {
        "service": "amazon_polly",
        "videoId": "-tC55viYFQo",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "Amazon Polly",
            "text-to-speech",
            "facial animation",
            "Speech Marks",
            "Whispered SSML Tag"
        ],
        "title": "Amazon Polly Adds New Whispered Voice Tag, and Speech Marks for Synchronization w/Visual Animation",
        "description": "Learn more about Amazon Polly at - http://amzn.to/2pgs2fU.\nAmazon Polly is a service that turns text into lifelike speech, making it easy to add voice to your website, mobile app, or device. You can add high-quality male or female voice output to your video, presentation, or online training course, by example, with 47 lifelike voices across 24 languages.\n\nTo enhance the lifelike experience of using Amazon Polly voices, you can now easily add a whispered speech effect in your Text-to-Speech output. To create voices that mimic the effect of whispering, you simply use the SSML tag “whispered” to mark the text input to be spoken in a hushed or whispered voice. This tag can be applied to any of the 47 voices in Polly’s Text-to-Speech portfolio.\n\nIn addition to content creation, Amazon Polly now enables developers to provide speech-synchronized facial animation or karaoke-style word highlighting. Through the use of Speech Marks, you can add an enhanced visual experience to your application through synchronized speech. This is particularly useful if you have an application with an animated avatar – say, a gaming application -- which requires the ability to synchronize lips with voice, or you are using Polly in an educational environment, highlighting text for an enhanced reading experience. When used in combination with the synthesized speech audio stream, Speech Marks enables you to build applications that leverage the exact timing of when particular sentences, words and sounds are being produced, for a more engaging and animated experience when interacting with your voice-enabled application. You can try both new features through the Amazon Polly console.",
        "date": "2017-04-19T20:06:10Z",
        "duration": 132
    },
    {
        "service": "amazon_polly",
        "videoId": "zjMqimHis3U",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "AWS re:Invent 2656aws reinvent",
            "reinvent2016",
            "aws",
            "cloud",
            "amazon web services",
            "aws cloud",
            "re:Invent",
            "Machine Learning Mini Con",
            "MAC204",
            "Rafal Kuklinski",
            "Manoj Sindhwani",
            "Introductory (200 level)"
        ],
        "title": "AWS re:Invent 2016: NEW LAUNCH! Introducing Amazon Polly (MAC204)",
        "description": "This session will introduce you to Amazon Polly, a new deep learning service that turns text into lifelike speech. Polly enables existing applications to speak as a first class feature and creates the opportunity for entirely new categories of speech-enabled products – from mobile apps and cars, to devices and appliances. Polly includes 47 lifelike voices and support for 24 languages, so you can select the ideal voice and distribute your speech-enabled applications in many geographies. Polly is easy to use – you just send the text you want converted into speech to the Polly API, and Polly immediately returns the audio stream to your application so you can play it directly or store it in a standard audio file format, such as MP3. Polly supports Speech Synthesis Markup Language (SSML) tags like prosody so you can adjust the speech rate, pitch, or volume. Polly is a secure service that delivers all of these benefits at high scale and at low latency. You can cache and replay Polly’s generated speech at no additional cost. Polly lets you convert 5M characters per month for free during the first year. Polly’s pay-as-you-go pricing, low cost per request, and lack of restrictions on storage and reuse of voice output make it a cost-effective way to enable speech synthesis everywhere.  Join this session to learn more and find out how you get can started with Amazon Polly, today!",
        "date": "2016-12-06T22:34:13Z",
        "duration": 2763
    },
    {
        "service": "amazon_polly",
        "videoId": "Yj513sy2rCw",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "Rekognition",
            "Amazon Polly",
            "Twitch",
            "AWS Pop-up Loft",
            "London Loft"
        ],
        "title": "Live from the London Loft | Introducing Amazon Rekognition and Amazon Polly",
        "description": "Visit http://amzn.to/2xMoS6H for more information on the current live coding shows, upcoming episode schedule, or for recordings of previous broadcasts. To learn more about the AWS Pop-up Loft | London, please visit https://awsloft.london/.\n\nHost: Ian Massingham, Senior Technical Evangelist\nLive from the London Loft, Senior Technical Evangelist, Ian Massingham introduces Amazon Rekognition and Amazon Polly.",
        "date": "2017-10-02T03:55:37Z",
        "duration": 2989
    },
    {
        "service": "amazon_polly",
        "videoId": "HTjkjMr8vzQ",
        "tags": [
            "AWS re:Invent 2017",
            "Amazon",
            "Machine Learning",
            "MCL206",
            "Polly"
        ],
        "title": "AWS re:Invent 2017: Creating Next Generation Speech-Enabled Applications with Amazon (MCL206)",
        "description": "Amazon Polly is a service that turns text into lifelike speech, making it easy to develop applications that use high-quality speech to increase engagement and accessibility. Get a glimpse into successful applications that use Amazon Polly text-to-speech service to enable an app to talk to its users. Attendees will benefit from understanding real-world business use cases, and learn how to add feature-rich voice capabilities to their new or existing applications.",
        "date": "2017-11-28T18:23:13Z",
        "duration": 2476
    },
    {
        "service": "amazon_polly",
        "videoId": "TeLvFqLW_0A",
        "tags": [
            "AWS re:Invent 2017",
            "Amazon",
            "Machine Learning",
            "MCL301",
            "Lex",
            "Polly"
        ],
        "title": "AWS re:Invent 2017: Building a Voice-Enabled Customer Service Chatbot Using Amazon L (MCL301)",
        "description": "Amazon Lex is a service for building conversational interfaces into any application using voice and text, and Amazon Polly is a service that turns text into lifelike speech. This session combines both of these AWS services during which the presenter will demonstrate how to build a Help Desk chatbot that feature spoken-voice interfaces. Attendees will be provided with the foundational skills for those looking to enrich their applications with natural, conversational interfaces. Liberty Mutual Insurance will also present on their chat platform architecture to demonstrated how they areusing Amazon Lex in their organization as an employee digital assistant.",
        "date": "2017-11-29T16:14:47Z",
        "duration": 3626
    },
    {
        "service": "amazon_polly",
        "videoId": "84qIFomfnLk",
        "tags": [
            "Pedro",
            "AI/ML",
            "AWS Summit Online ASEAN re:Cap",
            "Paez",
            "AWS",
            "Deep Learning",
            "ML",
            "Cloud Computing",
            "Amazon Web Services",
            "Machine Learning"
        ],
        "title": "AWS Summit Online ASEAN 2020 | Turn Text Into Lifelike Speech Using Deep Learning",
        "description": "Turn text into lifelike speech using deep learning (Level 200 - Intermediate)\nThe Amazon Polly text-to-speech (TTS) service uses advanced deep learning technologies to synthesise natural-sounding human speech. In this session, learn how you can create a custom voice for the exclusive use of your organisation with Amazon Polly Brand Voice.\n\nAWS Speaker: Sev Gassauer-Fleissner, Sr. Solutions Architect, Global\n\nDownload the slides: https://go.aws/3b0DX4H\n\nLearn more about AWS at - https://amzn.to/2FyowH3\n\nSubscribe: \nMore AWS videos http://bit.ly/2O3zS75 \nMore AWS events videos http://bit.ly/316g9t4  \n\n#AWS #AWSSummit #AWSEvents",
        "date": "2020-08-28T18:00:13Z",
        "duration": 799
    }
]