[
    {
        "service": "efs",
        "videoId": "fHM69E1EzvE",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "AWS Cloud",
            "Cloud Computing",
            "Amazon EFS",
            "Elastic File System",
            "EFS Lifecycle Management"
        ],
        "title": "Introduction to Amazon EFS Infrequent Access",
        "description": "This short demo shows you how to easily get started with the Amazon Elastic File System Infrequent Access (EFS IA) storage class and optimizing storage cost with a EFS Lifecycle Management policy. \n\nAmazon EFS Infrequent Access provides price and performance for files not accessed everyday and automatically moves your files to the lower cost EFS IA storage class based on the lifecycle management policy you choose.\n\nLearn more about Amazon EFS at https://go.aws/2xFOGUy\n\nSubscribe: \nMore AWS videos http://bit.ly/2O3zS75 \nMore AWS events videos http://bit.ly/316g9t4\n\n#AWS #AWSDemo #AmazonEFS",
        "date": "2020-05-07T19:45:50Z",
        "duration": 185
    },
    {
        "service": "efs",
        "videoId": "d4Ee4djegyg",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "edward naim",
            "Computer File",
            "File System (Software Genre)",
            "Amazon Elastic Compute Cloud (Software)"
        ],
        "title": "Amazon Elastic File System (EFS): Easily Deploy and Scale Durable File Systems with AWS",
        "description": "Amazon EFS is a new fully-managed service that makes it easy to set up and scale shared file storage in the AWS Cloud. Amazon EFS supports NFSv4, and is designed to be highly available and durable. Amazon EFS can support thousands of concurrent EC2 client connections with consistent performance, making it ideal for a wide range of uses cases, including content repositories, development environments, and home directories, as well as big data applications that require on-demand scaling of file system capacity and performance. In this session, we’ll provide an overview of EFS, walk through the creation of a file system, discuss EFS’ availability and durability properties, and review security features.",
        "date": "2015-04-10T21:56:24Z",
        "duration": 2624
    },
    {
        "service": "efs",
        "videoId": "u4tIM9TZJV4",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud"
        ],
        "title": "How do I parallelize copying data to and from Amazon EFS to maximize performance?",
        "description": "Find more details in the AWS Knowledge Center:  https://amzn.to/2LWuvXa \nGautam, an AWS Cloud Support Engineer, shows you how to parallelize copying data to and from Amazon EFS to maximize performance.",
        "date": "2019-08-27T22:14:12Z",
        "duration": 329
    },
    {
        "service": "efs",
        "videoId": "xAa5e9ckSQk",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "Twitch",
            "Live Coding",
            "AWS Summit",
            "AWS EFS",
            "Amazon Elastic"
        ],
        "title": "Amazon EFS Now Supports Encryption of Data in Transit",
        "description": "Click here to learn more - https://amzn.to/2qoNT2J.\nHear how Amazon EFS now allows you to encrypt data in transit between your file system and its clients.Amazon Elastic File System (Amazon EFS) provides simple, scalable, elastic file storage for use with AWS Cloud services and on-premises resources. The Amazon EFS encryption of data in transit feature uses industry-standard Transport Layer Security (TLS) 1.2 to encrypt all data sent to and from connected clients. To further simplify using EFS, a new mount helper utility is available that can be used to establish encrypted client connections to either encrypted at rest or unencrypted file systems. With this launch, Amazon EFS now offers a comprehensive encryption solution, allowing customers to encrypt their data both at rest and in transit.",
        "date": "2018-04-10T17:14:11Z",
        "duration": 801
    },
    {
        "service": "efs",
        "videoId": "wiGONE0QVq0",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud"
        ],
        "title": "Deep Dive on Amazon EFS (126407)",
        "description": "In this session we will review Amazon EFS and how it delivers fully managed, petabyte-scale file storage for Amazon EC2 instances. Large scale and consistent performance make Amazon EFS ideal for web and content serving, enterprise applications, media processing, container storage, and Big Data analytics use cases. Session attendees will learn how to identify appropriate applications for use with Amazon EFS, understand performance details and security models, and hear how established customers are using it in production. The target audience is file system administrators, application developers, and application owners that operate or build file-based applications that require consistent latencies at cloud scale.",
        "date": "2017-06-19T20:21:11Z",
        "duration": 2249
    },
    {
        "service": "efs",
        "videoId": "4GFAQ2UuQy4",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "Amazon EFS",
            "Elastic file system",
            "Amazon Elastic File System"
        ],
        "title": "Amazon EFS: Deploying Scalable, Shared File Systems",
        "description": "Learn more: https://aws.amazon.com/efs\n\nThis video gives an overview of EFS, walks through the creation of a file system, discusses EFS availability and durability properties, and reviews security features.\n\nAmazon Elastic File System (Amazon EFS) is a new fully managed service that makes it easy to set up and scale shared file storage in the AWS cloud.  Amazon EFS supports NFS v4 and is designed to be highly available and durable. \n\nAmazon EFS can support thousands of concurrent Amazon EC2 client connections with consistent performance, making it ideal for a wide range of use cases, including content repositories, development environments, and home directories, as well as big data applications that require on-demand scaling of file system capacity and performance.",
        "date": "2015-07-10T22:09:40Z",
        "duration": 2247
    },
    {
        "service": "efs",
        "videoId": "d8F79OPic4g",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "Amazon Elastic File System"
        ],
        "title": "Amazon Elastic File System",
        "description": "Amazon Elastic File System provides simple, scalable file storage for use with Amazon EC2 instances in the AWS Cloud. Amazon EFS is easy to use and offers a simple interface that allows you to create and configure file systems quickly and easily. With Amazon EFS, storage capacity is elastic, growing and shrinking automatically as you add and remove files, so your applications have the storage they need, when they need it.\n\nLearn more: http://amzn.to/2ahQJ4P",
        "date": "2016-07-21T19:17:55Z",
        "duration": 76
    },
    {
        "service": "efs",
        "videoId": "bPpKV_6MFUc",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud"
        ],
        "title": "Introducing Amazon Elastic File System",
        "description": "Amazon EFS is a new, fully-managed service that makes it easy to set up and scale shared file storage in the AWS Cloud. Amazon EFS supports NFSv4, and is designed to be highly available and durable. Amazon EFS can support thousands of concurrent EC2 client connections, making it ideal for a uses cases that require on-demand scaling of file system capacity and performance.",
        "date": "2015-04-10T16:06:18Z",
        "duration": 169
    },
    {
        "service": "efs",
        "videoId": "R6gGLIflGbQ",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "Amazon Elastic File System",
            "New York Summit Series 2017",
            "EFS"
        ],
        "title": "AWS Summit Series 2017 – New York: Amazon EFS Introduces Support for Encryption of Data at Rest",
        "description": "Learn more about Amazon Elastic File System at http://amzn.to/2wLw2aJ.\nAmazon Elastic File System (EFS) now allows you to encrypt your data at rest using keys managed through AWS Key Management Service (KMS). Encryption and decryption are handled seamlessly, so you don’t have to modify your applications to access your data.\n\nWhen you create a new file system, you can choose to enable encryption via the AWS Management Console or API. To encrypt your data, you can use the default EFS key automatically created in your account or a key you generated.\n\nEncryption at rest is available at no additional cost in all Amazon EFS regions.",
        "date": "2017-09-08T22:25:41Z",
        "duration": 76
    },
    {
        "service": "efs",
        "videoId": "FSu7GWbth8A",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "Amazon EFS",
            "Amazon Elastic File System",
            "AWS Summit Series",
            "AWS Summit Series 2015",
            "AWS Summit Tel Aviv",
            "AWS Israel"
        ],
        "title": "AWS Summit Series 2015 | Tel Aviv: Amazon EFS Demo",
        "description": "Watch this Amazon EFS Live Demo by Guy Ernest which was presented at the AWS Summit Tel Aviv 2015. Learn more: https://aws.amazon.com/efs",
        "date": "2015-07-31T21:41:57Z",
        "duration": 1242
    },
    {
        "service": "efs",
        "videoId": "gWgmKv1-z0c",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "Amazon EFS"
        ],
        "title": "AWS Summit Series 2017: London - Deep Dive on Amazon Elastic File System (Amazon EFS)",
        "description": "Learn more about AWS at - http://amzn.to/2yVYl4w.\nIn this session we will review Amazon EFS and how it delivers fully managed, petabyte-scale file storage for Amazon EC2 instances. Large scale and consistent performance make Amazon EFS ideal for web and content serving, enterprise applications, media processing, container storage, and Big Data analytics use cases. Session attendees will learn how to identify appropriate applications for use with Amazon EFS, understand performance details and security models, and hear how established customers are using it in production. The target audience is file system administrators, application developers, and application owners that operate or build file-based applications that require consistent latencies at cloud scale.\n\nSpeaker: Paul Moran, Technical Account Manager, AWS",
        "date": "2017-10-25T16:09:59Z",
        "duration": 2013
    },
    {
        "service": "efs",
        "videoId": "izyP-PXSgIQ",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "AWS Cloud",
            "Cloud Computing",
            "move to managed",
            "file storage",
            "aws storage",
            "aws cloud storage",
            "amazon fsx",
            "amazon fsx for windows file server",
            "amazon efs",
            "amazon elastic file system",
            "aws datasync",
            "aws snow family",
            "aws storage gateway",
            "aws file storage",
            "hybrid file storage",
            "smb file shares",
            "nfs file systems",
            "file migration",
            "data migration",
            "hybrid cloud storage"
        ],
        "title": "Move to Managed File Storage with AWS",
        "description": "With your file storage that runs industry standard SMB and NFS protocols, you can leverage AWS file storage services like Amazon FSx and Amazon EFS in the cloud to improve agility and TCO, enhance availability and performance, strengthen your security posture, and create faster time-to-market. You can benefit from a range of cloud storage solutions to easily move to managed file storage without making changes to your existing applications or workflows. Move your on-premises file data to fully managed AWS Cloud file storage today to start maximizing your data.\n\nLearn more about file storage with AWS at https://amzn.to/328J9RD\n\nSubscribe: \nMore AWS videos http://bit.ly/2O3zS75 \nMore AWS events videos http://bit.ly/316g9t4\n\n#AWS",
        "date": "2020-08-20T20:18:21Z",
        "duration": 201
    },
    {
        "service": "efs",
        "videoId": "6WjQCKZ-9sM",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "Amazon Elastic File System",
            "Amazon EFS",
            "BBC",
            "Red Button",
            "Storage",
            "File Storage",
            "Shared",
            "Amazon EC2",
            "Amazon SNS",
            "Amazon SQS",
            "Amazon Kinesis"
        ],
        "title": "BBC Leverages Shared File Storage to Migrate Red Button Application to the AWS Cloud",
        "description": "Learn more about Amazon EFS at - https://amzn.to/2P5wo2n.\nBy using Amazon Elastic File System (Amazon EFS) to share files, the BBC was able to build an agile and cost-effective solution, migrating their on-premises Red Button interactive TV service to the AWS cloud. Leveraging services such as Amazon EC2, Amazon EFS, Amazon SNS, Amazon SQS, and Amazon Kinesis they were able to move their entire application on time and within budget.",
        "date": "2018-08-28T22:21:21Z",
        "duration": 230
    },
    {
        "service": "efs",
        "videoId": "8-DLfwi9roU",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "Creative Market"
        ],
        "title": "20,000 Creative Market Shops Turn Passion into Opportunity Using AWS and Amazon EFS",
        "description": "By using Amazon Elastic File System (Amazon EFS) as storage for over one million image files and for the staging of shop owners product files, Creative Market was able to replace the use of their Gluster solution. This completely eliminated the administrative complexities of their Gluster solution and provided them with consistent performance, on-demand scalability, and 95 percent annual savings. Creative Market offers independent creatives a platform where they can open shops to sell their digital creations—fonts, graphics, themes, photos, and software add-ons—to more than three million members. Shop owners set their own prices and keep 70 percent of their sales, leaving payment processing, distribution, and marketing to Creative Market.",
        "date": "2017-06-02T17:06:10Z",
        "duration": 260
    },
    {
        "service": "efs",
        "videoId": "aosw-p2Osbw",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "Amazon Elastic File System",
            "Amazon EFS",
            "AWS Storage Gateway",
            "LoanLogics",
            "Storage",
            "File Storage",
            "Shared"
        ],
        "title": "LoanLogics Kickstarts their All-in Move to the AWS Cloud with AWS Storage Gateway and Amazon EFS",
        "description": "Learn more at about Amazon Elastic File System (EFS) at - https://amzn.to/2qAuOv6.\nLoanLogics started their journey from their redundant managed service facilities to the AWS Cloud with AWS Storage Gateway and Amazon EFS. By adopting AWS as their cloud infrastructure provider, they were able to integrate the AWS technologies into their development and operational processes. This allowed their development and product teams to advance their core products for their clients at an accelerated pace. As a rapidly growing company, the speed, agility, and scale offered by migrating all-in to AWS enabled LoanLogics to focus on the differentiated value that they provide to their customers.\n\nLoanLogics enterprise loan quality management platform enables mortgage lenders, servicers, insurers, and investors to validate compliance, manage risk and optimize human capital during the manufacture, sale, and servicing of loan assets.",
        "date": "2018-11-07T20:54:55Z",
        "duration": 195
    },
    {
        "service": "efs",
        "videoId": "CV5jXn8Dqsw",
        "tags": [
            "AWS",
            "Events",
            "efs",
            "persistent storage",
            "eks",
            "aws",
            "kubernetes"
        ],
        "title": "AWS Container Day - Persistent File Storage for Amazon EKS with Amazon EFS",
        "description": "Containerizing applications that require data persistence or shared storage is often challenging since containers are ephemeral in nature, are scaled in and out dynamically, and typically clear any saved state when terminated. In this session you will learn about Amazon Elastic File System (EFS), a fully managed, elastic, highly-available, scalable, secure, high-performance, cloud native, shared file system that enables data to be persisted separately from compute for your Amazon Elastic Kubernetes Service (EKS) deployments. You’ll gain an understanding of the EFS Container Storage Interface (CSI) driver, and how it simplifies configuring elastic file storage for Kubernetes clusters.\n\nLearn more about Amazon EKS at - https://amzn.to/2QzNwjy\n \nSubscribe: \nMore AWS videos http://bit.ly/2O3zS75 \nMore AWS events videos http://bit.ly/316g9t4\n\n#AWS #AWSEvent",
        "date": "2020-08-31T16:31:22Z",
        "duration": 1547
    },
    {
        "service": "efs",
        "videoId": "4FQvJ2q6_oA",
        "tags": [
            "re:Invent 2018",
            "Amazon",
            "AWS re:Invent",
            "Storage",
            "STG301-R1",
            "Amazon Elastic",
            "File System",
            "Amazon EFS"
        ],
        "title": "AWS re:Invent 2018: [REPEAT 1] Deep Dive on Amazon Elastic File System (Amazon EFS) (STG301-R1)",
        "description": "In this session, we explore the world's first cloud-scale file system and its targeted use cases. Learn about Amazon Elastic File System (Amazon EFS), its features and benefits, how to identify applications that are appropriate to use with Amazon EFS, and details about its performance and security models. The target audience is security administrators, application developers, and application owners who operate or build file-based applications.",
        "date": "2018-11-30T16:26:55Z",
        "duration": 3340
    },
    {
        "service": "efs",
        "videoId": "k8Udnqlp9iQ",
        "tags": [
            "reInvent 2018",
            "Amazon",
            "AWSreInvent2018",
            "Storage",
            "STG327"
        ],
        "title": "AWS re:Invent 2018: How Amazon EFS Infrequent Access Optimizes File System Costs (STG327)",
        "description": "In this session, we introduce the Infrequent Access storage class for Amazon EFS. Amazon EFS Infrequent Access is a cost-optimized storage class for files not accessed every day, reducing storage costs by up to 85% compared to the Amazon EFS Standard storage class. Along with EFS IA, we will introduce EFS Lifecycle Management, which automatically transitions infrequently accessed files into the new storage class. Come learn how Amazon EFS Infrequent Access will work and how to get started. The target audience is file system administrators and application owners who are looking to more cost-effectively run file-based applications in the cloud.",
        "date": "2018-12-13T01:02:58Z",
        "duration": 1533
    },
    {
        "service": "efs",
        "videoId": "lMRVg2f380Y",
        "tags": [
            "aws-reinvent",
            "reinvent2015",
            "aws",
            "cloud",
            "cloud computing",
            "amazon web services",
            "aws cloud",
            "Storage & Content Delivery",
            "STG306",
            "Timothy Harder - Amazon Web Services",
            "Advanced (300 level)"
        ],
        "title": "AWS re:Invent 2015 | (STG306) EFS Update",
        "description": "In this session we will review the world’s first cloud-scale network attached file system and its targeted use cases. Session attendees will learn about EFS’s benefits, how to identify applications that are appropriate for use with EFS, and details about its performance and security models. The target audience is file system administrators, application developers, and application owners that operate or build file-based applications.",
        "date": "2015-10-12T16:19:12Z",
        "duration": 2877
    },
    {
        "service": "efs",
        "videoId": "VffbHp34UzQ",
        "tags": [
            "AWS re:Invent 2017",
            "Amazon",
            "Storage",
            "STG307",
            "AI",
            "Security"
        ],
        "title": "AWS re:Invent 2017: Deep Dive on Amazon Elastic File System (Amazon EFS) (STG307)",
        "description": "In this session, we explore the world’s first cloud-scale file system and its targeted use cases. Learn about Amazon EFS features and benefits, how to identify applications that are appropriate for use with Amazon EFS, and details about its performance and security models. The target audience is security administrators, application developers, and applications owners who operate or build file-based applications.",
        "date": "2017-11-29T16:08:02Z",
        "duration": 3588
    },
    {
        "service": "efs",
        "videoId": "gidUa4lJd9Y",
        "tags": [
            "re:Invent 2018",
            "Amazon",
            "AWS re:Invent",
            "Storage",
            "STG213-L"
        ],
        "title": "AWS re:Invent 2018: What's New in Amazon S3, Amazon EFS, Amazon EBS, & more (STG213-L)",
        "description": "Mai-Lan Tomsen Bukovec, VP of Amazon S3, introduces the latest innovations across all AWS storage services. In this keynote address, we announce new storage capabilities, and we talk about features and services that make AWS storage unique. We focus on new innovations in object storage, file storage, block storage, and data transfer services. You also hear from executives from companies that are major AWS storage customers, Sony and Expedia, about how they're using AWS storage to create a competitive advantage in their businesses. Complete Title: AWS re:Invent 2018: AWS Storage Leadership Session: What's New in Amazon S3, Amazon EFS, Amazon EBS, & more (STG213-L)",
        "date": "2018-11-30T16:26:53Z",
        "duration": 3523
    },
    {
        "service": "efs",
        "videoId": "N-4d5Su9s74",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "AWS re:Invent 2016",
            "aws reinvent",
            "reinvent2016",
            "aws",
            "cloud",
            "amazon web services",
            "aws cloud",
            "re:Invent",
            "Storage",
            "STG208",
            "Alexander Crosett III",
            "Introductor"
        ],
        "title": "AWS re:Invent 2016: Case Study: How Monsanto Uses Amazon EFS with Geospatial Data Sets (STG208)",
        "description": "At Monsanto, we build and use technologies that support our data and also BI efforts that facilitate intelligent, data-driven decisions. In the past year, we've embarked on large-scale efforts to modernize our geospatial platform and improve our analytic processing capabilities by building out new cloud and open-source based services. We found using Amazon Elastic File System (Amazon EFS) gave us the flexibility and performance we were seeking while saving us significant time, effort, and cost. In this session, we discuss how Monsanto uses the Amazon EFS service to run our large scaling geospatial data sets such as raster, and to perform highly parallelized analytics for data scientists and business users. Topics include the technical architecture, how and why we chose EFS for handling data sets that are terabytes in size, our recommendations, and the lessons learned along the way.",
        "date": "2016-12-03T18:16:46Z",
        "duration": 3061
    },
    {
        "service": "efs",
        "videoId": "IbB-3-kP2_M",
        "tags": [
            "AWS re:Invent 2017",
            "Amazon",
            "Zhitnitsky",
            "Storage",
            "STG315"
        ],
        "title": "AWS re:Invent 2017: Case Study: Learn How Thomson Reuters Uses Amazon EFS to Deliver (STG315)",
        "description": "In the fast-paced world of news media, having a high performance, reliable storage service is a critical component for delivering content at scale. Learn how Thomson Reuters leverages Amazon EFS to host their rich media content, saving them time and money while delivering unmatched reliability. Come hear about their journey, their approach, their architecture, and the considerations they took when building out their environment. Best practices and tips for success will be shared throughout.",
        "date": "2017-12-01T16:13:47Z",
        "duration": 3517
    },
    {
        "service": "efs",
        "videoId": "s4ptjYf22fA",
        "tags": [
            "AWS re:Invent 2017",
            "Amazon",
            "Demo Theater",
            "20800",
            "AI",
            "Storage"
        ],
        "title": "AWS re:Invent 2017: Live Demo: Accelerating Data Movement into Amazon EFS (DEM78)",
        "description": "Amazon EFS file systems are distributed across an unconstrained number of storage servers and allows massively parallel access. This means that highly parallelized workloads can drive high levels of aggregate throughput and operations per second. In less than 15 minutes, this demo illustrates how you can parallelize the data copy and accelerate the data movement into Amazon EFS.",
        "date": "2017-11-30T16:14:00Z",
        "duration": 934
    },
    {
        "service": "efs",
        "videoId": "slQsYL2ar1c",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "AWS re:Invent 2016",
            "aws reinvent",
            "reinvent2016",
            "aws",
            "cloud",
            "amazon web services",
            "aws cloud",
            "re:Invent",
            "Storage",
            "STG207",
            "Darryl Osborne",
            "Introductory (200"
        ],
        "title": "AWS re:Invent 2016: Case Study: How Atlassian Uses Amazon EFS with JIRA to Cut Costs (STG207)",
        "description": "At Atlassian, we create popular software tools to help every team unleash their full potential. We use our issue tracking tool JIRA to handle customer support issues from around the globe. As the business grew, we decided to move from a single server instance of JIRA to our JIRA Data Center product on AWS infrastructure to increase reliability, scale, and security. JIRA Data Center's requirement to use a shared file system caused us to try several in-house and third-party solutions prior to the availability of Amazon Elastic File System (Amazon EFS). We chose EFS for its performance, ease of use, automatic scaling, and out-of-the-box distribution capabilities. In this session, we discuss how Atlassian uses EFS to run JIRA Data Center. Topics include the technical architecture, how and why we chose EFS, our recommendations, and the lessons learned along the way.",
        "date": "2016-12-03T18:20:05Z",
        "duration": 2107
    },
    {
        "service": "efs",
        "videoId": "_Fgxl52OZes",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud"
        ],
        "title": "Amazon EFS",
        "description": "Amazon EFS provides a simple, scalable, elastic file system for Linux-based workloads for use with AWS Cloud services and on-premises resources. You can now create up to 1,000 file systems per AWS account, an increase from the existing limit of 125. You can also now create up to 400 EFS mount targets per Amazon Virtual Private Cloud (VPC).  \n\nCatch up on the excitement of re:Invent 2018 with the AWS launchpad featuring launch announcements, demos of newly launched technology, interviews with expert guests and live Q&A. AWS re:Invent is a tech education conference for the global cloud computing community hosted by Amazon Web Services. See all recordings of the AWS Launchpad at re:Invent here: https://www.youtube.com/playlist?list=PLhr1KZpdzukc0WXQruGVXTiNPtct-LLaa and learn more about AWS live streaming here: https://aws.amazon.com/twitch.",
        "date": "2018-11-30T20:48:19Z",
        "duration": 1116
    },
    {
        "service": "efs",
        "videoId": "hzialJerb5o",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "AWS re:Invent 2016",
            "aws reinvent",
            "reinvent2016",
            "aws",
            "cloud",
            "amazon web services",
            "aws cloud",
            "re:Invent",
            "Storage",
            "STG206",
            "Sajee Mathew",
            "Introductory (200 level)"
        ],
        "title": "AWS re:Invent 2016: Case Study: Spokeo Improved Web Application Response Times with EFS (STG206)",
        "description": "At Spokeo, we are running a fast, big data, and high-traffic website providing people search services. But at our scale, we started to reach limitations to how fast our conventional web stack could do things and concluded that a Ruby on Rails–only solution simply couldn't keep up. In this session, we cover some of the options we had to solve this problem and why we chose Amazon Elastic File System (Amazon EFS) as a central part of our solution with metrics and benchmarking. Using EFS, we were able to take response times down from 250 ms to below 70 ms. We look into the architecture of the solution and lessons we learned along the way. In the end, we find that faster response times are just the beginning of the benefits that we see.",
        "date": "2016-12-03T03:55:27Z",
        "duration": 2299
    },
    {
        "service": "efs",
        "videoId": "PlTuJx4VnGw",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "AWS re:Invent 2016",
            "aws reinvent",
            "reinvent2016",
            "aws",
            "cloud",
            "amazon web services",
            "aws cloud",
            "re:Invent",
            "STG202",
            "Edward Naim",
            "Darryl Osborne",
            "Introductory",
            "Storage"
        ],
        "title": "AWS re:Invent 2016: Deep Dive on Amazon Elastic File System (STG202)",
        "description": "In this session, we fill you in about Amazon EFS, including an overview of this recently introduced service, its use cases, and best practices for working with it.",
        "date": "2016-12-02T18:26:37Z",
        "duration": 3738
    },
    {
        "service": "efs",
        "videoId": "FJlHXBcDJiw",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "AWS Cloud",
            "Cloud Computing",
            "aws",
            "amazon",
            "amazon web services",
            "aws efs",
            "amazon efs",
            "secure efs",
            "elastic file system",
            "elastic filesystem",
            "ecs",
            "amazon ecs",
            "fargate",
            "aws fargate",
            "elastic container service",
            "aws demo",
            "aws tutorial"
        ],
        "title": "Amazon EFS: Secure data persistence with Amazon ECS and AWS Fargate",
        "description": "In this demo, we’re going to use Amazon EFS to create a shared file system, and then attach it to existing Amazon ECS and AWS Fargate services. We’ll also explore how AWS IAM Authorization and EFS Access Points can simplify configuring more granular access to our data for different scenarios. \n\nAmazon Elastic File System (EFS) provides a simple, scalable, and fully-managed shared file system for use with AWS Cloud services and on-premises resources. Whether you’re developing a new containerized application or modernizing an existing monolith, there are many types of applications where a shared persistence layer is an essential ingredient in achieving a resilient and durable architecture.\n\nLearn more about AWS Storage at - https://go.aws/3e7MdSF\n\nPersistent File Storage for Modern Applications: https://go.aws/2LKgsmd\nGitHub sample code repository: https://bit.ly/2TlBewC\nTutorial on using Amazon EFS File Systems with Amazon ECS: https://amzn.to/3g5FPNr\nAWS News Blog launch announcement: https://go.aws/3bLWLoP\nDevelopers guide to using Amazon EFS with Amazon ECS and AWS Fargate: https://go.aws/3e53pZ0\n\n\nSubscribe: \nMore AWS videos http://bit.ly/2O3zS75 \nMore AWS events videos http://bit.ly/316g9t4\n\n#AWS #AmazonEFS",
        "date": "2020-05-20T21:25:32Z",
        "duration": 852
    },
    {
        "service": "efs",
        "videoId": "pCbDfTKry-c",
        "tags": [
            "re:Invent 2019",
            "Amazon",
            "AWS re:Invent",
            "STG304-R",
            "Storage",
            "Amazon EFS"
        ],
        "title": "AWS re:Invent 2019: [REPEAT] Network file system (NFS) evolved: Deep dive on Amazon EFS (STG304-R)",
        "description": "In this session, we explore the world’s first cloud-scale file system and its targeted use cases. Learn about Amazon Elastic File System (Amazon EFS) features and benefits, how to identify applications that are appropriate for use with Amazon EFS, and details about the service’s performance and security models. The target audience is security administrators, application developers, application owners, and infrastructure operations personnel who build or operate file-based applications or NAS.",
        "date": "2019-12-13T19:55:57Z",
        "duration": 3020
    },
    {
        "service": "efs",
        "videoId": "cc_me0l0PfA",
        "tags": [
            "re:Invent 2019",
            "Amazon",
            "AWS re:Invent",
            "STG364",
            "Storage",
            "Qube Research",
            "Technologies Ltd."
        ],
        "title": "AWS re:Invent 2019: Securing Amazon EFS for container and data science applications (STG364)",
        "description": "In this session, we explore how you can use Amazon Elastic File System (Amazon EFS), a scalable, elastic, cloud-native NFS file system to modernize your applications and data science environments. We cover considerations and best practices when connecting Amazon EFS file systems to applications running in containers in multiple frameworks. We also show you how to make the most use of Amazon EFS for data science environments as a repository for notebook files and a place where data scientists can rapidly iterate on training data.",
        "date": "2019-12-04T17:31:51Z",
        "duration": 2573
    }
]