[
    {
        "service": "fsx",
        "videoId": "IMDWTIShlyI",
        "title": "Amazon FSx for Windows File Server",
        "date": "2020-03-12T16:31:35Z",
        "description": "Learn about Amazon's fully managed, native Windows file system service called Amazon FSx for Windows File Server. In this video, we'll walkthrough the ..."
    },
    {
        "service": "fsx",
        "videoId": "YO-i6GIGD1E",
        "title": "Migrating your Data to Amazon FSx for Windows File Server with AWS DataSync",
        "date": "2020-03-12T16:25:37Z",
        "description": "Learn how to easily migrate your on-premises file servers to Amazon FSx for Windows File Server using AWS DataSync which is AWS's data transfer service."
    },
    {
        "service": "fsx",
        "videoId": "ZuHgNDKrvek",
        "title": "Working with Backups on Amazon FSx for Windows File Server",
        "date": "2020-03-12T16:26:52Z",
        "description": "Learn how to work with backups on Amazon FSx for Windows File Server. In this video, we discuss how to create, restore and delete backups. We also explore ..."
    },
    {
        "service": "fsx",
        "videoId": "mpt0whv9nRI",
        "title": "Empowering Users to Restore Files with Shadow Copies on Amazon FSx for Windows File Server",
        "date": "2020-03-12T16:29:21Z",
        "description": "Learn how to empower your users to do their own file restores on Amazon FSx for Windows File Server using shadows copies. In this video, we'll walkthrough ..."
    },
    {
        "service": "fsx",
        "videoId": "pySNkXcZCsI",
        "title": "How to Access Amazon FSx for Windows File Server from a Linux Client",
        "date": "2020-03-12T16:30:31Z",
        "description": "In this video, we will learn how to join a Linux instance to an AWS Directory Service for Microsoft Active Directory directory and mount an Amazon FSx for ..."
    },
    {
        "service": "fsx",
        "videoId": "SxFag4CMWU8",
        "title": "Sisense: Using Amazon EKS and FSx for Lustre for Multi-Source Data Ingestion and Presentation",
        "date": "2020-10-07T17:48:59Z",
        "description": "Learn how Sisense architected its ElastiCube solution so that organizations can create BI dashboards with data ingested from multiple sources. The solution is ..."
    },
    {
        "service": "fsx",
        "videoId": "nCcAMStPsvQ",
        "title": "How can I configure self-managed AD Mutli-AZ FSx permissions?",
        "date": "2020-10-22T16:35:02Z",
        "description": "For more details see the Knowledge Center article with this video: https://aws.amazon.com/premiumsupport/knowledge-center/fsx-multi-az-self-managed-ad/ ..."
    },
    {
        "service": "fsx",
        "videoId": "4v08-CzjH1U",
        "title": "Amazon FSx for Lustre: High-Performance File System for Processing Amazon S3 or On-Premises Data",
        "date": "2019-07-18T14:00:00Z",
        "description": "Amazon FSx for Lustre is a high-performance file system for processing Amazon S3 or on-premises data. Learn more at - https://amzn.to/2GglrJa. With Amazon ..."
    },
    {
        "service": "fsx",
        "videoId": "izyP-PXSgIQ",
        "title": "Move to Managed File Storage with AWS",
        "date": "2020-08-20T20:18:21Z",
        "description": "With your file storage that runs industry standard SMB and NFS protocols, you can leverage AWS file storage services like Amazon FSx and Amazon EFS in the ..."
    },
    {
        "service": "fsx",
        "videoId": "PBKVRIwx2kw",
        "title": "HPC on AWS Event - Amazon FSx for Lustre Fast and Scalable Storage for Compute Workloads",
        "date": "2020-11-09T22:26:24Z",
        "description": "This video will introduce you to Amazon FSx for Lustre, a fully managed service that provides cost-effective, high-performance storage for compute workloads."
    },
    {
        "service": "fsx",
        "videoId": "iV2Tk6ApbVY",
        "title": "AWS re:Invent 2019: What&#39;s new in AWS file storage (STG202)",
        "date": "2019-12-05T17:53:20Z",
        "description": "In this session, we focus on innovations in the fast-growing AWS file-storage portfolio, including Amazon Elastic File System (Amazon EFS), Amazon FSx for ..."
    },
    {
        "service": "fsx",
        "videoId": "a_yqyj5x9_Y",
        "title": "I&#39;m a Sys Admin -  What&#39;s New in File Storage (Level 300)",
        "date": "2020-09-01T18:36:12Z",
        "description": "In this session, we focus on innovations in the fast-growing AWS file storage portfolio, including Amazon Elastic File System (Amazon EFS), Amazon FSx for ..."
    },
    {
        "service": "fsx",
        "videoId": "qrKZRH3mQRA",
        "title": "What&#39;s New in AWS File Storage - Level 300 (United States)",
        "date": "2020-07-24T19:02:22Z",
        "description": "In this session, we focus on innovations in the fast-growing AWS file storage portfolio, including Amazon Elastic File System (Amazon EFS), Amazon FSx for ..."
    },
    {
        "service": "fsx",
        "videoId": "hAftP5QqppQ",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "reInvent 2018",
            "Amazon",
            "AWSreInvent2018",
            "Storage",
            "STG322-R1"
        ],
        "title": "AWS re:Invent 2018: [NEW LAUNCH!] Deep Dive on Amazon FSx for Windows File Server (STG322-R1)",
        "description": "In this session, we explore the new fully managed service that makes it easy to launch and use shared file storage for Windows applications. FSx for Windows provides fully managed file storage built on Microsoft Windows Server, providing native support for Windows file system features and for the Server Message Block (SMB) protocol. Learn about Amazon FSx for Windows File Server features and benefits, and details about its performance and security models. The target audience is storage administrators, application developers, and applications owners and infrastructure operations personnel who build or operate file-based Windows applications or NAS.",
        "date": "2018-12-03T20:24:49Z",
        "duration": 3610
    },
    {
        "service": "fsx",
        "videoId": "FSO9r0UbH2E",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "reInvent 2018",
            "Amazon",
            "AWSreInvent2018",
            "Storage",
            "STG317"
        ],
        "title": "AWS re:Invent 2018: [NEW LAUNCH!] Amazon FSx for Lustre: A new fully managed file system (STG317)",
        "description": "An introduction of Amazon FSx for Lustre, a new service that provides a fully managed parallel file system that enables compute-intensive applications to process large data sets at up to hundreds of gigabytes per second of throughput, millions of IOPS, and consistent low latencies. Learn how Amazon FSx is seamlessly integrated with Amazon S3, making your in-cloud data sets available to your compute-intensive applications. In this introductory session, we will provide a deep dive on this new service, discuss performance capabilities, AWS integrations, and highlight use cases for this high-performance file storage offering.",
        "date": "2018-12-01T22:22:21Z",
        "duration": 3675
    },
    {
        "service": "fsx",
        "videoId": "mMDrUuZFm8M",
        "tags": [
            "reInvent 2018",
            "Amazon",
            "AWSreInvent2018",
            "Storage",
            "STG318"
        ],
        "title": "AWS re:Invent 2018: [NEW LAUNCH!] Scale out file system performance using Amazon FSx (STG318)",
        "description": "Increase application performance of your IO intensive workloads by ‘sharding’ data across multiple FSx for Windows file systems. This allows applications to read and write data in parallel from 10’s, 100’s, or 1000’s of Amazon EC2 instances and achieve greater performance then what’s available from a single file system.  Scale out your compute and scale out or file storage to achieve AWSome performance.",
        "date": "2018-12-13T16:33:02Z",
        "duration": 1000
    },
    {
        "service": "fsx",
        "videoId": "s482kj_xMeE",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "AWS Cloud",
            "Cloud Computing",
            "FSX",
            "Shadow Copies",
            "File Server",
            "Windows"
        ],
        "title": "Using DFS Namespaces with Amazon FSx for Windows File Server",
        "description": "In this video, you’ll learn how to integrate Amazon FSx for Windows File Server with Microsoft’s Distributed File System (DFS). We’ll walkthrough how to integrate the Amazon FSx file system into a DFS namespace which can simplify user access, scale performance, and help organize large amounts of data.\n\nLearn more about Amazon FSx for Windows File Server at https://go.aws/2vdKfiJ\n\nSubscribe: \nMore AWS videos http://bit.ly/2O3zS75 \nMore AWS events videos http://bit.ly/316g9t4 \n\n#AWS #AmazonFSx",
        "date": "2020-03-12T16:28:12Z",
        "duration": 891
    },
    {
        "service": "fsx",
        "videoId": "_x_Geur93oc",
        "tags": [
            "re:Invent 2019",
            "Amazon",
            "AWS re:Invent",
            "STG306-R1",
            "Storage",
            "Not Applicable"
        ],
        "title": "AWS re:Invent 2019: [REPEAT 1] Deep dive on Amazon FSx for Windows File Server (STG306-R1)",
        "description": "Amazon FSx for Windows File Server is a service that offers fully managed native Microsoft Windows file systems on AWS. It provides the compatibility and features that your Windows-based applications rely on, including full support for the SMB protocol, Windows NTFS, and Active Directory integration, and the fast performance your Windows applications and users expect, with high levels of throughput and IOPS, and consistent sub-millisecond latencies. In this session, storage administrators and application owners learn how to deploy, scale, and use highly available, highly durable, and elastic Windows file storage integrated with their organization’s existing Active Directory environments.",
        "date": "2019-12-10T18:45:56Z",
        "duration": 3850
    },
    {
        "service": "fsx",
        "videoId": "ZADHiZa3Hjo",
        "tags": [
            "re:Invent 2019",
            "Amazon",
            "AWS re:Invent",
            "STG307-R1",
            "Storage",
            "Amazon S3"
        ],
        "title": "AWS re:Invent 2019: Amazon S3 & FSx for Lustre: Dive on high-performance file storage (STG307-R1)",
        "description": "A technical deep dive into the Amazon FSx for Lustre service that provides customers a fully managed high-performance file system optimized for workloads such as machine learning, high performance computing (HPC), video processing, financial modeling, and electronic design automation (EDA). In this session, data scientists, researchers, and system administrators learn how to launch a file system that allows applications to access data at hundreds of gigabytes per second with sub-millisecond latencies, allowing them to rapidly process large data stored on long-term data stores like Amazon S3 or on-premises filers.",
        "date": "2019-12-07T05:52:53Z",
        "duration": 3664
    },
    {
        "service": "fsx",
        "videoId": "ttCAqwnN_Qo",
        "tags": [
            "AWS",
            "Events",
            "Amazon FSx",
            "FSx for Lustre"
        ],
        "title": "Amazon FSx for Lustre: Persistent Storage Overview",
        "description": "Amazon FSx for Lustre is a fully managed high-performance file system integrated with S3 and makes it easy and cost-effective to run the world's most popular file system. In this video, we will cover persistent performance options with FSx for Lustre and walk-through a common HPC use case example. \n\nLearn more about Amazon FSx for Lustre at https://go.aws/2S509nQ\n \nSubscribe: \nMore AWS videos http://bit.ly/2O3zS75 \nMore AWS events videos http://bit.ly/316g9t4\n\n#AWS #AWSDemo",
        "date": "2020-04-23T18:10:57Z",
        "duration": 530
    }
]