[
    {
        "service": "route_53",
        "videoId": "PVBC1gb78r8",
        "tags": [
            "AWS re:Invent 2017",
            "Amazon",
            "Networking",
            "NET302",
            "AI",
            "EC2",
            "Route 53",
            "VPC"
        ],
        "title": "AWS re:Invent 2017: DNS Demystified: Global Traffic Management with Amazon Route 53 (NET302)",
        "description": "In this mid-level architecture session, we cover everything you need to get started with Amazon Route 53, AWS's highly available DNS service. Learn how to use public DNS, including routing techniques such as weighted round-robin, latency-based routing, and geo DNS. Learn also how to configure DNS failover using health checks, how and when to use private DNS within your VPC, and how Amazon Route 53 interacts with Amazon EC2's DNS for instance naming and DNS resolution across your network. We also walk through how to use Traffic Flow to manager traffic to your applications' globally distributed endpoints to optimize for constraints such as endpoint load, the health of your resources, geographic restrictions, and internet latency.",
        "date": "2017-11-29T16:13:14Z",
        "duration": 2801
    },
    {
        "service": "route_53",
        "videoId": "e2xLV7pCOLI",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "DNS",
            "Amazon Route 53",
            "Domain Name System",
            "re:Invent 2016"
        ],
        "title": "What is DNS? - Introduction to Domain Name System",
        "description": "Learn more about DNS using Amazon Route 53 and step by step instructions on setting up Domain Name System for your web application using Amazon Route 53 - http://amzn.to/2hPmuRv.",
        "date": "2016-12-15T00:32:58Z",
        "duration": 1346
    },
    {
        "service": "route_53",
        "videoId": "D1n5kDTWidQ",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "re:Invent 2018",
            "Amazon",
            "AWS re:Invent",
            "Networking",
            "NET215",
            "Amazon Route 53",
            "AWS Direct Connect"
        ],
        "title": "AWS re:Invent 2018: Introduction to Amazon Route 53 Resolver for Hybrid Cloud (NET215)",
        "description": "Amazon Route 53 Resolver provides recursive DNS for your Amazon VPC and on-premises networks over VPN or AWS Direct Connect. This session will review common use cases for Route 53 Resolver and go in depth on how it works.",
        "date": "2018-12-05T21:24:04Z",
        "duration": 1456
    },
    {
        "service": "route_53",
        "videoId": "AAq-DDbFiIE",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "AWS re:Invent 2016",
            "aws reinvent",
            "reinvent2016",
            "aws",
            "cloud",
            "amazon web services",
            "aws cloud",
            "re:Invent",
            "Networking",
            "NET202",
            "Sean Meckley",
            "Introductory (200 Level)"
        ],
        "title": "AWS re:Invent 2016: DNS Demystified: Amazon Route 53, featuring Warner Bros. (NET202)",
        "description": "Whether you’re running a simple website, a mobile app, or a suite of business applications, DNS is a fundamental part of any architecture in the cloud. In this mid-level architecture session, we’ll cover everything you need to get started with Amazon Route 53, AWS’s highly-available DNS service. You’ll learn how to use public DNS, including routing techniques such as weighted round-robin, latency-based routing, and geo DNS; how to configure DNS failover using health checks; how and when to use private DNS within your Virtual Private Cloud (VPC); and how Amazon Route 53 interacts with Amazon EC2’s DNS for instance naming and DNS resolution across your network.\n    \n   We will conclude the session with a real-world migration example. Warner Bros. Entertainment recently completed a full DNS migration to Route 53. Vahram Sukyas, Vice President, Application Infrastructure & Operations at Warner Bros. Entertainment, will share details on his team's architecture, migration strategy, and lessons learned which are useful for enterprises and startups alike.",
        "date": "2016-12-03T22:25:06Z",
        "duration": 2579
    },
    {
        "service": "route_53",
        "videoId": "QU7FQBgL0Po",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "AWS re:Invent 2016",
            "aws reinvent",
            "reinvent2016",
            "aws",
            "cloud",
            "amazon web services",
            "aws cloud",
            "re:Invent",
            "NET302",
            "sergey royt",
            "Advanced (300 Level)",
            "Networking"
        ],
        "title": "AWS re:Invent 2016: Global Traffic Management with Amazon Route 53 Traffic Flow (NET302)",
        "description": "As companies grow and expand their global footprint, it becomes increasingly critical to make systems highly available while also improving responsiveness to end-users. Companies are choosing to place their applications closer to end-users to improve performance, which introduces the complications of how to route end-user traffic to the most appropriate endpoints and how to most efficiently route traffic within internal systems.\n\nIn this session, learn how customers are using Route 53's Traffic Flow service for global traffic management, improving performance and availability for end users while reducing IT management cost.  We will walk through how to use Traffic Flow to manager traffic to your applications' globally-distributed endpoints to optimize for constraints such as endpoint load, the health of your resources, geographic restrictions, and Internet latency. We'll demonstrate how you can configure multiple routing policies and take advantage of code control and versioning for easier management of your DNS and traffic management configuration.",
        "date": "2016-12-03T21:54:46Z",
        "duration": 1800
    },
    {
        "service": "route_53",
        "videoId": "YPNzeuNd-lA",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "AWS Cloud",
            "Cloud Computing",
            "AWS Knowledge Center Videos"
        ],
        "title": "Why is the Route 53 Alias record for an Elastic Load Balancer not working or resolving?",
        "description": "For more details see the Knowledge Center article with this video: https://aws.amazon.com/premiumsupport/knowledge-center/elb-route-53-unresolved-alias-record\nVanit shows you why Route 53 Alias record for an Elastic Load Balancer is not working or resolving.",
        "date": "2020-04-07T16:40:31Z",
        "duration": 147
    },
    {
        "service": "route_53",
        "videoId": "qsUKki0TUuc",
        "tags": [
            "Route 53",
            "DNS",
            "Domain Name System",
            "Hosted Zone",
            "Queries",
            "Reliability",
            "Latency",
            "Name Servers",
            "Resource Records",
            "Resource Record Sets",
            "A Record",
            "CNAME",
            "AWS",
            "Amazon Web Services"
        ],
        "title": "Using the Route 53 Management Console",
        "description": "A tutorial on how to use the Route 53 management console to set up a domain and create several types of records",
        "date": "2011-11-16T01:32:51Z",
        "duration": 1119
    },
    {
        "service": "route_53",
        "videoId": "FFv_6t3jE78",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "aws knowledge center videos",
            "route 53",
            "health check",
            "set up route 53 health check",
            "how to"
        ],
        "title": "AWS Knowledge Center Videos: How do I set up a Route 53 health check?",
        "description": "Find more details in the AWS Knowledge Center:  https://aws.amazon.com/premiumsupport/knowledge-center/fail-over-s3-r53/\n\nDiego, an AWS Solutions Architect, shows you how to set up a Route 53 health check.",
        "date": "2017-06-28T14:21:46Z",
        "duration": 514
    },
    {
        "service": "route_53",
        "videoId": "PnOFP4EZ6hs",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud"
        ],
        "title": "How do I create an Amazon Route 53 Health Check?",
        "description": "Find more details in the AWS Knowledge Center: https://amzn.to/31ZlOjt\nDanill, an AWS Cloud Support Engineer, shows you how to create an Amazon Route 53 Health Check.",
        "date": "2019-11-18T17:45:37Z",
        "duration": 223
    },
    {
        "service": "route_53",
        "videoId": "zxSDRPQRd50",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "AWS Knowledge Center Videos"
        ],
        "title": "How do I configure geoproximity routing using the Route 53 console?",
        "description": "Find more details in the AWS Knowledge Center: https://amzn.to/2Po9dRZ\nShree, an AWS Cloud Support Engineer, shows you how to configure geoproximity routing using the Route 53 console.",
        "date": "2019-05-23T21:56:25Z",
        "duration": 255
    },
    {
        "service": "route_53",
        "videoId": "W4FPZ29Trpw",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "aws knowledge center videos",
            "domain",
            "transfer",
            "route 53"
        ],
        "title": "AWS KC Videos: How do I migrate my DNS service for an existing domain to Amazon Route 53?",
        "description": "Find more details in the AWS Knowledge Center: https://aws.amazon.com/premiumsupport/knowledge-center/transfer-domain-to-aws/ \n\nBehnaz, an AWS Support Team Member, shows you how to migrate your DNS service for an existing domain to Amazon Route 53.",
        "date": "2017-05-03T15:47:11Z",
        "duration": 201
    },
    {
        "service": "route_53",
        "videoId": "6TwqSw_IUjM",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "Route 53",
            "Hosted Zone"
        ],
        "title": "How do I delete a Route 53 hosted zone?",
        "description": "Find more details in the AWS Knowledge Center: https://amzn.to/2CngwVL\nGnaneshwari, an AWS Cloud Support Engineer, shows you how to delete a Route 53 hosted zone.",
        "date": "2018-11-19T15:18:36Z",
        "duration": 122
    },
    {
        "service": "route_53",
        "videoId": "VxhBxSaN8ss",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "AWS Knowledge Center Videos"
        ],
        "title": "How do I delete a Route 53 Hosted Zone created by ECS Service Discovery via AWS Cloud Map service?",
        "description": "Find more details in the AWS Knowledge Center: https://amzn.to/2XrQOqn\nShree, an AWS Cloud Support Engineer, shows you how to delete a Route 53 Hosted Zone created by ECS Service Discovery via AWS Cloud Map service.",
        "date": "2019-06-11T18:14:54Z",
        "duration": 130
    },
    {
        "service": "route_53",
        "videoId": "qRMu1ZOfbhs",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "Warner Bros.",
            "Amazon Route 53",
            "re:Invent 2016"
        ],
        "title": "Warner Bros. on Amazon Route 53 - Customer Success Story",
        "description": "Learn more - http://amzn.to/2hGSLyg\n\nWarner Bros. Entertainment, a global leader in the creation, production, distribution, licensing, and marketing of all forms of entertainment, has a portfolio of more than 25,000 domains and websites serving viewers around the world. Warner Bros. Entertainment completed a full DNS migration to Amazon Route 53 in order to increase performance, fault tolerance and geographical distribution, decrease maintenance overhead, and improve security. Vahram Sukyas, Vice President, Application Infrastructure & Operations at Warner Bros. Entertainment, shares details on DNS architecture, migration strategy, and lessons learned which are useful for enterprises and startups alike.",
        "date": "2016-12-15T00:34:35Z",
        "duration": 895
    },
    {
        "service": "route_53",
        "videoId": "mHJA4Jijm6Q",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "AWS Knowledge Center Videos",
            "Route 53"
        ],
        "title": "How do I enable reverse DNS lookup in Amazon Route 53?",
        "description": "Find more details in the AWS Knowledge Center: https://amzn.to/2S5rGCv\nGnaneshwari, an AWS Cloud Support Engineer, shows you how to enable reverse DNS lookup in Amazon Route 53.",
        "date": "2019-03-21T18:05:03Z",
        "duration": 247
    },
    {
        "service": "route_53",
        "videoId": "GTwajBL0uzU",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "AWS Cloud",
            "Cloud Computing",
            "AWS Knowledge Center"
        ],
        "title": "How do I use a Route 53 Resolver inbound endpoint to resolve DNS records in a private hosted zone?",
        "description": "For more details see the Knowledge Center article with this video: https://aws.amazon.com/premiumsupport/knowledge-center/route53-resolve-with-inbound-endpoint/\n\nAbhishek shows you how to configure a Route 53 Resolver inbound endpoint to resolve DNS records in your Route 53 private hosted zone from your remote network.",
        "date": "2020-08-17T19:49:25Z",
        "duration": 275
    },
    {
        "service": "route_53",
        "videoId": "8PQw3FgRGxo",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "multi-region",
            "health checks",
            "SimilarWeb",
            "Amazon Route 53",
            "Amazon Simple Storage Service (S3)",
            "TMA",
            "This is My Architecture"
        ],
        "title": "SimilarWeb: Route 53 Calculated Health Checks for an Active/Active Multi-Region Architecture",
        "description": "On this episode of This is My Architecture https://amzn.to/2zCHg2v, Oz from SimilarWeb walks us through how they use 2 AWS regions in an active/active scenario. They use a Route 53 decision tree, including calculated health checks, to both figure out if a region is healthy as well as trigger a planned maintenance fail-over of a region.\n\nHost: Benjamin Feldon, Sr. Manager, Solutions Architecture, AWS Financial Services\nCustomer: Oz Katz, VP R&D, Production Engineering, SimilarWeb\n\nSubscribe: \nMore AWS videos http://bit.ly/2O3zS75 \nMore AWS events videos http://bit.ly/316g9t4\n\n#AWS",
        "date": "2018-11-08T19:09:52Z",
        "duration": 432
    },
    {
        "service": "route_53",
        "videoId": "f9y-T7mQVxs",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "aws-reinvent",
            "reinvent2014",
            "Services Deep Dive",
            "Expert",
            "Amazon EC2",
            "Archive",
            "Backup & Disaster Recovery",
            "Architecture",
            "Amazon Route 53",
            "Loggly",
            "Architect",
            "Enterprise",
            "Developer",
            "Manoj Chaudhary",
            "Lee-Ming Zen"
        ],
        "title": "AWS re:Invent 2014 | (SDD408) Amazon Route 53 Deep Dive: Delivering Resiliency, Minimizing Latency",
        "description": "Learn how to utilize Amazon Route 53 latency-based routing, weighted round-robin, and other features in conjunction with DNS failover to direct traffic to the least latent, most available endpoints across a global infrastructure. We explore topics such as balancing traffic between endpoints in terms of load and latency, and discuss how to provide multi-record answers to improve client-side resiliency.  As part of this session, Loggly will present how they utilize Route 53 for their traffic management needs.",
        "date": "2014-11-14T21:01:45Z",
        "duration": 2490
    },
    {
        "service": "route_53",
        "videoId": "xfCKXuofY60",
        "tags": [
            "Amazon",
            "Route53",
            "cloud",
            "computing",
            "Cloud Computing",
            "AWS",
            "Web",
            "Services",
            "DNS",
            "domain",
            "routing"
        ],
        "title": "Getting Started with Amazon Route53",
        "description": "Try out Route53 with this short educational video.",
        "date": "2011-12-14T20:23:22Z",
        "duration": 197
    },
    {
        "service": "route_53",
        "videoId": "WDDkLOT8SCk",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "Netflix",
            "Amazon Route 53",
            "Zuul",
            "multi region",
            "AWS Regions",
            "Coburn Watson",
            "DNS",
            "Elastic Load Balancing",
            "TMA",
            "This is My Architecture"
        ],
        "title": "Netflix: Multi-Regional Resiliency and Amazon Route 53",
        "description": "Learn more about This Is My Architecture at - http://amzn.to/2iFvHA9.\nWhat happens when you need to move 89 million viewers to a different AWS region? Netflix's infrastructure, built on AWS, makes it possible to be extremely resilient, even when you're running services in many AWS Regions simultaneously. In this episode of This is My Architecture, Coburn Watson, Director of Performance and Reliability Engineering at Netflix, will take us through a DNS architecture – built on Amazon Route 53 and augmented with Netflix's Zuul – that allows them to evacuate an entire region in under 40 minutes.\n\nSubscribe: \nMore AWS videos http://bit.ly/2O3zS75 \nMore AWS events videos http://bit.ly/316g9t4\n\n#AWS",
        "date": "2017-01-05T18:58:46Z",
        "duration": 255
    },
    {
        "service": "route_53",
        "videoId": "9k6FNy_HB40",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "aws knowledge center videos",
            "Amazon Route 53"
        ],
        "title": "My server cannot receive email after creating an MX record for my SMTP server in Amazon Route 53",
        "description": "Find more details in the AWS Knowledge Center: https://aws.amazon.com/premiumsupport/knowledge-center/route-53-mx-record-smtp-no-email/\n\nManshi, an AWS Cloud Support Engineer, shows you what you can do if after creating an MX record for my SMTP server in Amazon Route 53, your server cannot receive email.",
        "date": "2018-07-17T22:23:37Z",
        "duration": 403
    },
    {
        "service": "route_53",
        "videoId": "UiXRVHgQ_Gg",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "aws",
            "cloud",
            "amazon web services",
            "aws cloud",
            "aws-reinvent",
            "reinvent2013solution-architecture-and-best-practices",
            "architecture",
            "enterprise",
            "route53",
            "acceleration",
            "cloudfront",
            "cdn",
            "Parviz-Deyhim",
            "ARC309",
            "arc"
        ],
        "title": "Dynamic Content Acceleration: Amazon CloudFront and Amazon Route 53 (ARC309) | AWS re:Invent 2013",
        "description": "Traditionally, content delivery networks (CDNs) were known to accelerate static content. Amazon CloudFront has come a long way and now supports delivery of entire websites that include dynamic and static content. In this session, we introduce you to CloudFront's dynamic delivery features that help improve the performance, scalability, and availability of your website while helping you lower your costs. We talk about architectural patterns such as SSL termination, close proximity connection termination, origin offload with keep-alive connections, and last-mile latency improvement. Also learn how to take advantage of Amazon Route 53's health check, automatic failover, and latency-based routing to build highly available web apps on AWS.",
        "date": "2013-11-26T19:43:25Z",
        "duration": 3124
    },
    {
        "service": "route_53",
        "videoId": "DCy40ZRwMmo",
        "tags": [
            "aws knowledge center videos",
            "amazon route 53",
            "dns service",
            "resource record set",
            "values",
            "internic whois",
            "domain"
        ],
        "title": "\"What can I check when I'm unable to access my website when using the Amazon Route 53 DNS service?\"",
        "description": "Find more details in the AWS Knowledge Center: https://aws.amazon.com/premiumsupport/knowledge-center/route-53-dns-website-unreachable/\nDoug, an AWS Cloud Support Engineer, shows what to check when you are unable to access your website using the Amazon Route 53 DNS service.",
        "date": "2016-06-10T15:39:16Z",
        "duration": 287
    },
    {
        "service": "route_53",
        "videoId": "l5HSED9FiPI",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "aws",
            "cloud",
            "amazon web services",
            "aws cloud",
            "aws-reinvent",
            "reinvent2013solution-architecture-and-best-practices",
            "compute-networking",
            "startups",
            "elastic load balancing",
            "route-53",
            "availability",
            "scalability",
            "Paul-Kearney",
            "CPN204",
            "cpn"
        ],
        "title": "Availability & Scalability with Elastic Load Balancing & Route 53 (CPN204) | AWS re:Invent 2013",
        "description": "Elastic Load Balancing provides a scalable and highly-available load balancer that automatically distributes incoming application traffic across multiple Amazon EC2 instances. It enables you to achieve even greater fault tolerance in your applications, seamlessly providing the amount of load balancing capacity needed in response to incoming application traffic. In this session, we take a deeper look at some of the existing and newer features that enable application developers to architect highly-available architectures that are resilient to load spikes and application failures. We also explore some of the features that allow seamless integration with services such as Auto Scaling and Amazon Route 53 to further improve the scalability and resilience of your applications.",
        "date": "2013-11-28T05:32:06Z",
        "duration": 2556
    },
    {
        "service": "route_53",
        "videoId": "3OK6VG7gqiw",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "webinar",
            "webcast",
            "DNS Failover",
            "Route 53",
            "High Availability"
        ],
        "title": "AWS Webcast - High Availability with Route 53 DNS Failover",
        "description": "This webinar will be discussing how to use DNS Failover to a range of high-availability architectures, from a simple backup website to advanced multi-region architectures.",
        "date": "2013-07-12T20:36:32Z",
        "duration": 3344
    },
    {
        "service": "route_53",
        "videoId": "ahnhoFgd5K4",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "aws knowledge center videos",
            "white label",
            "private",
            "vanity",
            "route 53"
        ],
        "title": "AWS KC Videos: How do I configure a white label name server using Route 53?",
        "description": "Find more details in the AWS Knowledge Center: https://aws.amazon.com/premiumsupport/knowledge-center/white-label-name-server/\n\nShreejesh, an AWS Cloud Support Engineer, shows you how to configure a white label name server using Amazon Route 53.",
        "date": "2017-05-08T14:58:19Z",
        "duration": 773
    },
    {
        "service": "route_53",
        "videoId": "MkYSiNTE-0U",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud",
            "Slack",
            "EC2 Spot Fleet",
            "On Demand Instances",
            "Amazon Cloudfront",
            "Amazon API Gateway",
            "Amazon Route53",
            "Amazon EC2",
            "Elastic Load Balancing",
            "HAProxy",
            "This is My Architecture",
            "TMA"
        ],
        "title": "Slack: Real-Time Communication with HAProxy and Route53 on AWS",
        "description": "On this episode of This is My Architecture, Slack shows us how they use web sockets, Cloudfront, HAProxy, and Route53 to build a real-time communication platform. Learn more at - http://amzn.to/2fEjkS5.\n\nSubscribe: \nMore AWS videos http://bit.ly/2O3zS75 \nMore AWS events videos http://bit.ly/316g9t4\n\n#AWS",
        "date": "2017-09-25T17:48:56Z",
        "duration": 344
    },
    {
        "service": "route_53",
        "videoId": "XXUYbdbCb6Q",
        "tags": [
            "aws-reinvent",
            "reinvent2015",
            "aws",
            "cloud",
            "cloud computing",
            "amazon web services",
            "aws cloud",
            "Networking",
            "NET308",
            "Sean Meckley - Amazon",
            "Lee Zen - Amazon.com",
            "Advanced (300 level)"
        ],
        "title": "AWS re:Invent 2015 | (NET308) Consolidating DNS Data in the Cloud with Amazon Route 53",
        "description": "In this session, we show you how to use Amazon Route 53 to consolidate your DNS data and manage it centrally. Learn how to use Amazon Route 53 for public DNS and for private DNS in VPC, and also learn how to combine Amazon Route 53 private DNS with your own DNS infrastructure.",
        "date": "2015-10-12T21:44:10Z",
        "duration": 1742
    },
    {
        "service": "route_53",
        "videoId": "zsitzG6Qiag",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "cloud computing",
            "AWS Cloud"
        ],
        "title": "Simplify the DNS for your Hybrid Cloud and Easily Scale Across VPCs",
        "description": "Catch up with Maritza Mills and Mohamed Hassan, AWS Senior Product Managers , on Amazon Route 53 Resolver and AWS Transit Gateway, both of which will simplify your network. Route 53 Resolver simplifies your DNS for your hybrid clouds. AWS Transit Gateway simplifies and scales connectivity across thousands of VPCs, AWS accounts, and on-premises connections. Review our blogs and and product pages for more information. Route 53 Resolver blog: https://aws.amazon.com/blogs/aws/new-amazon-route-53-resolver-for-hybrid-clouds/ Route 53 Resolver product page: aws.amazon.com/route53 AWS Transit Gateway blog: https://aws.amazon.com/blogs/aws/new-use-an-aws-transit-gateway-to-simplify-your-network-architecture/ AWS Transit Gateway product page: aws.amazon.com/transit-gateway\n\nCatch up on the excitement of re:Invent 2018 with the AWS launchpad featuring launch announcements, demos of newly launched technology, interviews with expert guests and live Q&A. AWS re:Invent is a tech education conference for the global cloud computing community hosted by Amazon Web Services. See all recordings of the AWS Launchpad at re:Invent here: https://www.youtube.com/playlist?list=PLhr1KZpdzukc0WXQruGVXTiNPtct-LLaa and learn more about AWS live streaming here: https://aws.amazon.com/twitch.",
        "date": "2018-11-30T20:21:44Z",
        "duration": 1043
    },
    {
        "service": "route_53",
        "videoId": "_A4084pNCTc",
        "tags": [
            "AWS",
            "Amazon Web Services",
            "Cloud",
            "AWS Cloud",
            "Cloud Computing",
            "AWS Knowledge Center Videos"
        ],
        "title": "Why can't I select my preferred alias target when creating a Route 53 alias resource record set?",
        "description": "For more details see the Knowledge Center article with this video: https://aws.amazon.com/premiumsupport/knowledge-center/route-53-no-targets/ .\n\nPavya shows you why you can't select your preferred alias target when creating a Route 53 alias resource record set.",
        "date": "2020-08-14T22:25:13Z",
        "duration": 290
    },
    {
        "service": "route_53",
        "videoId": "_Z5jAs2gvPA",
        "tags": [
            "re:Invent 2019",
            "Amazon",
            "AWS re:Invent",
            "NET410",
            "Networking & Content Delivery",
            "Amazon Route 53"
        ],
        "title": "AWS re:Invent 2019: Deep dive on DNS in the hybrid cloud (NET410)",
        "description": "The launch of Amazon Route 53 Resolver endpoints and forwarding rules has opened up a variety of exciting new options for managing DNS resolution, especially in hybrid cloud environments. This session gives a quick overview of the product before taking a deep dive into the design of Route 53 Resolver, including how it complements Route 53 private DNS and best practices to achieve availability and performance. We also dive into some new patterns that are emerging with services such as AWS Transit Gateway, AWS PrivateLink, and AWS Directory Service for Microsoft Active Directory.",
        "date": "2019-12-04T17:36:43Z",
        "duration": 3300
    },
    {
        "service": "route_53",
        "videoId": "abOFqytVqBU",
        "tags": [
            "re:Invent 2019",
            "Amazon",
            "AWS re:Invent",
            "NET321",
            "Networking & Content Delivery",
            "AWS PrivateLink",
            "Amazon VPC",
            "Amazon Route 53"
        ],
        "title": "AWS re:Invent 2019: AWS PrivateLink deployments: DNS mechanisms for routing & resiliency (NET321)",
        "description": "Looking to consume AWS PrivateLink–enabled services from on premises? In this session, we provide you with guidance on how DNS mechanisms can be used to route traffic as well as build resiliency for your connections into PrivateLink-enabled services in the Amazon Virtual Private Cloud (Amazon VPC) infrastructure.",
        "date": "2019-12-09T18:51:53Z",
        "duration": 3462
    }
]